In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(data={"Col1": np.random.randint(560, 999,10),
                        "Col2": np.random.randn(10),
                        "Col3": np.random.choice(["A", "B", "C"], size= 10), 
                        "Col4": np.random.choice([True, False], size= 10), 
                        "Col5": np.random.randint(50, 100, 10)},
                    index=pd.date_range(start="01/01/2024", periods=10, freq="ME"))
df

            Col1      Col2 Col3   Col4  Col5
2024-01-31   884  1.450048    B  False    89
2024-02-29   834  0.009451    A  False    59
2024-03-31   712 -1.089515    C   True    62
2024-04-30   800 -0.113944    C  False    94
2024-05-31   731  0.835361    A   True    50
2024-06-30   723  1.001138    C   True    50
2024-07-31   637  0.783640    A  False    90
2024-08-31   720 -0.584472    C  False    69
2024-09-30   813  2.562680    A   True    96
2024-10-31   572 -0.831801    C  False    85

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2024-01-31 to 2024-10-31
Freq: ME
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    10 non-null     int32
 1   Col2    10 non-null     float64
 2   Col3    10 non-null     object
 3   Col4    10 non-null     bool
 4   Col5    10 non-null     int32
dtypes: bool(1), float64(1), int32(2), object(1)
memory usage: 330.0+ bytes

In [5]:
df.head()

            Col1      Col2 Col3   Col4  Col5
2024-01-31   884  1.450048    B  False    89
2024-02-29   834  0.009451    A  False    59
2024-03-31   712 -1.089515    C   True    62
2024-04-30   800 -0.113944    C  False    94
2024-05-31   731  0.835361    A   True    50

In [6]:
df.head(n=5)

            Col1      Col2 Col3   Col4  Col5
2024-01-31   884  1.450048    B  False    89
2024-02-29   834  0.009451    A  False    59
2024-03-31   712 -1.089515    C   True    62
2024-04-30   800 -0.113944    C  False    94
2024-05-31   731  0.835361    A   True    50

In [7]:
df.tail()

            Col1      Col2 Col3   Col4  Col5
2024-06-30   723  1.001138    C   True    50
2024-07-31   637  0.783640    A  False    90
2024-08-31   720 -0.584472    C  False    69
2024-09-30   813  2.562680    A   True    96
2024-10-31   572 -0.831801    C  False    85

In [10]:
df.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Col5'], dtype='object')

In [ ]:
df.shape

(10, 5)

In [ ]:
df.dtypes

Col1      int32
Col2    float64
Col3     object
Col4       bool
Col5      int32
dtype: object

In [23]:
df.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Col5'], dtype='object')

In [ ]:
type(df.columns)

pandas.core.indexes.base.Index

In [ ]:
df.columns.to_list()

['Col1', 'Col2', 'Col3', 'Col4', 'Col5']

In [ ]:
list(df.columns)

['Col1', 'Col2', 'Col3', 'Col4', 'Col5']

In [12]:
df["Col1"].unique()

array([884, 834, 712, 800, 731, 723, 637, 720, 813, 572], dtype=int32)

In [ ]:
df["Col3"].unique()

array(['C', 'B', 'A'], dtype=object)

In [ ]:
df

            Col1      Col2 Col3   Col4  Col5
2024-01-31   947 -0.373196    C  False    63
2024-02-29   698  1.294737    B  False    91
2024-03-31   878 -0.494710    A   True    93
2024-04-30   572 -0.429545    C   True    66
2024-05-31   956  0.378144    C   True    80
2024-06-30   775 -0.583026    C  False    56
2024-07-31   587  0.432975    C  False    68
2024-08-31   957  0.752827    B   True    55
2024-09-30   738 -0.311400    C  False    85
2024-10-31   805 -0.511479    C   True    69

In [ ]:
df["Col5"].nunique()

10

In [22]:
df.value_counts("Col2")

Col2
-1.089515    1
-0.831801    1
-0.584472    1
-0.113944    1
 0.009451    1
 0.783640    1
 0.835361    1
 1.001138    1
 1.450048    1
 2.562680    1
Name: count, dtype: int64

In [ ]:
df["Col3"].value_counts(normalize=True)

pandas.core.series.Series

In [ ]:
df

            Col1      Col2 Col3   Col4  Col5
2024-01-31   947 -0.373196    C  False    63
2024-02-29   698  1.294737    B  False    91
2024-03-31   878 -0.494710    A   True    93
2024-04-30   572 -0.429545    C   True    66
2024-05-31   956  0.378144    C   True    80
2024-06-30   775 -0.583026    C  False    56
2024-07-31   587  0.432975    C  False    68
2024-08-31   957  0.752827    B   True    55
2024-09-30   738 -0.311400    C  False    85
2024-10-31   805 -0.511479    C   True    69

In [ ]:
df.describe()

             Col1       Col2       Col5
count   10.000000  10.000000  10.000000
mean   791.300000   0.015533  72.600000
std    144.596027   0.653041  13.817863
min    572.000000  -0.583026  55.000000
25%    708.000000  -0.478419  63.750000
50%    790.000000  -0.342298  68.500000
75%    929.750000   0.419267  83.750000
max    957.000000   1.294737  93.000000

In [ ]:
df

            Col1      Col2 Col3   Col4  Col5
2024-01-31   947 -0.373196    C  False    63
2024-02-29   698  1.294737    B  False    91
2024-03-31   878 -0.494710    A   True    93
2024-04-30   572 -0.429545    C   True    66
2024-05-31   956  0.378144    C   True    80
2024-06-30   775 -0.583026    C  False    56
2024-07-31   587  0.432975    C  False    68
2024-08-31   957  0.752827    B   True    55
2024-09-30   738 -0.311400    C  False    85
2024-10-31   805 -0.511479    C   True    69

In [ ]:
df.describe(include="all")

              Col1       Col2 Col3   Col4       Col5
count    10.000000  10.000000   10     10  10.000000
unique         NaN        NaN    3      2        NaN
top            NaN        NaN    C  False        NaN
freq           NaN        NaN    7      5        NaN
mean    791.300000   0.015533  NaN    NaN  72.600000
std     144.596027   0.653041  NaN    NaN  13.817863
min     572.000000  -0.583026  NaN    NaN  55.000000
25%     708.000000  -0.478419  NaN    NaN  63.750000
50%     790.000000  -0.342298  NaN    NaN  68.500000
75%     929.750000   0.419267  NaN    NaN  83.750000
max     957.000000   1.294737  NaN    NaN  93.000000

In [ ]:
df.corr()

In [ ]:
np.random.seed(1)
new_df = pd.DataFrame(data = np.random.randint(55, 555, (3, 4)),
                      columns = np.random.choice(["A", "B"], size = 4),
                    index = pd.date_range(start="01/01/2025", periods= 3, freq= "W"))
new_df

              A    B    B    A
2025-01-05   92  290  451  127
2025-01-12  310  448  258  188
2025-01-19  390  503  199  184

In [ ]:
new_df.corr()

          A         B         B         A
A  1.000000  0.999939 -0.999330  0.948923
B  0.999939  1.000000 -0.999672  0.952337
B -0.999330 -0.999672  1.000000 -0.959837
A  0.948923  0.952337 -0.959837  1.000000